app/controllers/users_controller.rb

      def login
        @user = User.find_by(username: usr )
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'othman2' LIMIT 1